INSERT INTO policies (text, version, created_at, is_active) VALUES
    ('1.	Общие положения
    1.1. Настоящая Политика в отношении обработки персональных данных (далее — «Политика») разработана в соответствии с Конституцией Российской Федерации, Федеральным законом от 27.07.2006 №152-ФЗ «О персональных данных», иными нормативными правовыми актами Российской Федерации.
    1.2. Политика определяет порядок обработки и защиты персональных данных пользователей сайта https://moto-trip-253584681073.asia-east1.run.app/   (далее — «Сайт»), а также меры по обеспечению безопасности персональных данных.
    1.3. Оператором персональных данных является:
    ИП Корчевой Сергей Леонидович
    ОГРНИП 325270000031168, ИНН 272052105199
    Юридический адрес: 680509, Хабаровский край, с. Ильи́нка, ул. Совхозная, д. 34
    Email: mototrip@list.ru
    Телефон: +7 (914) 541-59-60
    1.4. Использование Сайта означает согласие пользователя с настоящей Политикой и условиями обработки его персональных данных.
    2.	Принципы обработки персональных данных
    Обработка персональных данных осуществляется на основе следующих принципов:
    •	законности и справедливости;
    •	обработки только тех данных, которые соответствуют заявленным целям;
    •	недопущения объединения баз данных, содержащих персональные данные, обработка которых осуществляется в несовместимых целях;
    •	обеспечения точности, достаточности и актуальности данных;
    •	хранения данных не дольше, чем этого требуют цели обработки;
    •	обеспечения безопасности персональных данных при их обработке.
    3.	Цели обработки персональных данных
    Персональные данные обрабатываются Оператором для следующих целей:
    •	обеспечение обратной связи с пользователями;
    •	предоставление доступа к функционалу Сайта;
    •	выполнение обязательств по договорам;
    •	информирование о продуктах, услугах, акциях;
    •	ведение внутренней статистики и аналитики;
    •	соблюдение требований законодательства Российской Федерации.
    4.	Состав обрабатываемых персональных данных
    К персональным данным, обрабатываемым Оператором, относятся:
    •	фамилия, имя;
    •	адрес электронной почты;
    •	номер телефона;
    •	IP-адрес, сведения о браузере и устройстве;
    •	год рождения;
    •	месяц рождения;
    •	дата рождения;
    •	место рождения;
    •	пол;
    •	сведения, собираемые посредством метрических программ;
    •	иная информация, предоставленная пользователем добровольно через формы на Сайте.
    5.	Правовые основания обработки
    Обработка персональных данных осуществляется на основании:
    •	согласия субъекта персональных данных;
    •	исполнения договора, стороной которого является субъект;
    •	необходимости выполнения обязанностей, возложенных законодательством РФ;
    •	законных интересов Оператора при условии, что это не нарушает права субъектов персональных данных.
    6.	Порядок и условия обработки персональных данных
    6.1. Обработка персональных данных осуществляется с использованием средств автоматизации и без использования таких средств.
    6.2. Персональные данные хранятся на серверах, расположенных на территории Российской Федерации (услуги хостинга — ООО «Таймвеб» нужно уточнить).
    6.3. Передача персональных данных третьим лицам допускается в случаях:
    •	получения согласия субъекта;
    •	необходимости исполнения договора;
    •	выполнения обязанностей, установленных законодательством РФ.
    6.4. В случае передачи персональных данных третьим лицам Оператор требует от таких лиц соблюдения конфиденциальности и обеспечения безопасности.
    7.	Трансграничная передача персональных данных
    При необходимости передачи персональных данных на территорию иностранных государств Оператор осуществляет такую передачу в соответствии со ст. 12 Федерального закона №152-ФЗ, обеспечивая надлежащий уровень защиты прав субъектов персональных данных.
    8.	Права субъектов персональных данных
    Субъект персональных данных имеет право:
    •	получать сведения об обработке своих персональных данных;
    •	требовать уточнения, блокирования или уничтожения своих данных;
    •	отзывать согласие на обработку персональных данных;
    •	обжаловать действия Оператора в Роскомнадзор или в судебном порядке.
    9.	Меры по обеспечению безопасности персональных данных
    Оператор принимает необходимые правовые, организационные и технические меры для защиты персональных данных от неправомерного или случайного доступа, уничтожения, изменения, блокирования, копирования, распространения, а также иных неправомерных действий.
    10.	Ответственность
    Оператор несет ответственность за соблюдение законодательства Российской Федерации о персональных данных.
    Пользователь несет ответственность за достоверность предоставляемых данных, а также за сохранение в тайне своих учетных данных (логинов и паролей).
    Пользователь гарантирует, что имеет законные основания для передачи персональных данных третьих лиц.
    11.	Сроки хранения персональных данных
    Персональные данные хранятся не дольше, чем этого требуют цели обработки, либо в течение срока, установленного законодательством Российской Федерации.
    12.	Изменение Политики
    12.1. Оператор вправе изменять настоящую Политику без предварительного уведомления пользователей.
    12.2. Новая редакция Политики вступает в силу с момента её размещения на Сайте.
    13.	Контакты
    По всем вопросам, связанным с обработкой персональных данных, субъекты могут обращаться:
    Email: mototrip@list.ru
    Телефон: +7 (914) 541-59-60
    ',
     '1.0.1',
     '2026-03-25 10:00:00',
     true);